[
{"title": "Implementació d'un sistema de compartició de fitxers", "url": "https://upcommons.upc.edu/handle/2117/329414", "author": "Gamiz Quer, Aniol", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-07", "rights": "Open Access", "abstract": "En un centre de recerca com el BSC es va identificar que la compartició de fitxers no estava ben solucionada en el model implantat actualment. S'ha fet una recerca entre diferents solucions i s'ha trobat que Nextcloud és ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.5010693073272705, "description": "En un centre de recerca com el BSC es va identificar que la compartició de fitxers no estava ben solucionada en el model implantat actualment. S'ha fet una recerca entre diferents solucions i s'ha trobat que Nextcloud és el producte que compleix més requeriments pel que fa al producte que busquem. S'hi ha realitzat un disseny del sistema final que inclou un backend i un frontend. El backend està compost pels diferents serveis que necessita la plataforma per funcionar, que són Apache, MariaDB, PHP i Redis. Dintre del backend també hem afegit un servei de Docker per poder executar un contenidor de paquets amb la plataforma OnlyOffice de manera que els diferents usuaris de Nextcloud puguin editar fitxers concurrentment. També dintre del backend s'ha habilitat la connexió amb el servidor de LDAP del centre per utilitzar els usuaris ja existents. En la part del frontend tenim les diferents interfícies web que es trobaran els usuaris quan es connectin amb el navegador sigui per compartir arxius o per poder editar documents. S'ha realitzat el pas a producció aplicant un monitoreig als diferents serveis de manera que en cas d'alguna fallada ens salta una alarma i podem actuar en conseqüència. Una vegada testejat amb usuaris s'ha comprovat que la majoria de requeriments que teníem al principi del projecte es compleixen correctament exceptuant dos casos determinats: el bloqueig de fitxers no és suportat per aquesta plataforma i el mapeig a Windows d'una unitat per protocol de xarxa DAV és problemàtic perquè la implementació d'aquest protocol en Windows és defectuosa. Finalment s'han fet diferents tests d'usuaris per comprovar que la interfície web funciona correctament i tests d'escalabilitat comprovant mesures de rendiment de CPU, memòria i xarxa per veure que l'aplicació no carrega el servidor excessivament. We have identified that the file-sharing between users is not working correctly in BSC. Research has been done between different solutions and it has been found that Nextcloud is the product that fits best with our problem. The design of the system includes the backend and the frontend. The backend is composed of all the different services the platform needs to work, which are Apache, MariaDB, PHP, and Redis. Inside backend, we can also find Docker service, to execute OnlyOffice software where the users can edit concurrently among other users, and connection to the LDAP server, where we take the information users. Inside the frontend, we have different web interfaces that users found when they connect to the system. The transition to production has been done applying monitoring to the different services so in the case one of them fails we will receive an alarm. Once tested with users, we can say that the majority of the initial requirements we had at the beginning of the project are fulfilled correctly except in two certain cases: file locking is not supported on this platform and network mapping using the DAV protocol because of the implementation of this protocol in certain operating systems. Finally, we've done many user tests to prove the web interface and some scalability tests to check the status of CPU, memory, and network and see how the system charge is affected.", "keywords": "Computer files Computer network protocols Fitxers informàtics Protocols de xarxes d'ordinadors"},
{"title": "Instrumentación de OpenACC en Extrae", "url": "https://upcommons.upc.edu/handle/2117/329436", "author": "Muhammad Shiekh, Ali", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-06-30", "rights": "Open Access", "abstract": "BSC-CNS es el centro de supercomputación nacional que dispone de sus propias herramientas Extrae, Paraver y Dimemas para hacer análisis de rendimiento en entornos HPC. Actualmente, Extrae no da soporte para el modelo de ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.796954870223999, "description": "BSC-CNS es el centro de supercomputación nacional que dispone de sus propias herramientas Extrae, Paraver y Dimemas para hacer análisis de rendimiento en entornos HPC. Actualmente, Extrae no da soporte para el modelo de programación paralela OpenACC. El objetivo de este proyecto es incorporar una nueva funcionalidad a la herramienta Extrae, para poder registrar la actividad de OpenACC, con la finalidad de usarse para hacer el análisis de rendimiento de aplicaciones OpenACC. BSC-CNS has developed and provides their own performance analysis tools, Extrae, Paraver and Dimemes for an HPC environment. As of today Extrae provides no support for the parallel programing model OpenACC. The aim of this project is to develop a new functionality for the Extrae tool that allows it to register the activity of the OpenACC model. And furthermore enable the performance analysis of OpenACC applications.", "keywords": "Parallel programming (Computer science) Supercomputers Programació en paral·lel (Informàtica) Supercomputadors"},
{"title": "Sistema de seguridad para moto con alertas", "url": "https://upcommons.upc.edu/handle/2117/329420", "author": "Avecilla García, Guillem", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-07", "rights": "Open Access", "abstract": "Actualmente, el crecimiento de la población y con ello la masificación de las ciudades ha hecho que los vehículos de un tamaño mayor o igual al promedio sean más difíciles de estacionar. Esto implica un crecimiento de la ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.8423001766204834, "description": "Actualmente, el crecimiento de la población y con ello la masificación de las ciudades ha hecho que los vehículos de un tamaño mayor o igual al promedio sean más difíciles de estacionar. Esto implica un crecimiento de la compra de vehículos pequeños, más en concreto en las motocicletas. Las motocicletas son un medio de desplazamiento pequeño y fácil de aparcar, hecho que ha provocado que, por ejemplo, Barcelona se convierta en la ciudad con más motos por habitante de la Unión Europea. Pero estos vehículos tienen sus inconvenientes y, uno de ellos, es la seguridad, tanto en circulación como cuando están estacionadas. Este proyecto tiene como objetivo crear un entorno que permita mantener la seguridad de estos vehículos, a fin de proteger la motocicleta y garantizar el bienestar del usuario. Currently the growth of the population and then the massification of the cities has made vehicles of a size greater than or equal to the normal average more difficult to park. This implies a growth in the purchase of small vehicles, more in concrete the motorcycles. These are a small displacement vehicle that are easy to park, fact that has caused, for example, Barcelona to become the city with the most number of motorcycles per inhabitant in the European Union. But these vehicles have their drawbacks and one of them is safety, both when you are driving and when the vehicle is parked. This project aims to create an environment that allows the safety of these vehicles, in order to protect the motorcycle and ensure the user's well-being.", "keywords": "Accelerometers Raspberry Pi (Computer) Acceleròmetres Raspberry Pi (Ordinador)"},
{"title": "Aplicació de desenvolupament de videojocs fàcil per a tothom", "url": "https://upcommons.upc.edu/handle/2117/329249", "author": "Valls Torres, Àlex", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-07-03", "rights": "Open Access", "abstract": "Aquest projecte consisteix en el desenvolupament d'una aplicació que permet crear videojocs senzills a usuaris que no disposen de coneixements tècnics en aquest àmbit. D'aquesta manera s'ha creat un motor gràfic amb unes ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.7942838668823242, "description": "Aquest projecte consisteix en el desenvolupament d'una aplicació que permet crear videojocs senzills a usuaris que no disposen de coneixements tècnics en aquest àmbit. D'aquesta manera s'ha creat un motor gràfic amb unes funcionalitats adaptades a aquest tipus de públic per tal d'oferir una experiència còmoda i instructiva, al mateix temps que les eines proporcionades són suficientment flexibles per poder-se combinar entre elles de formes creatives i arribar a generar creacions més complexes. Així doncs s'ha utilitzat C++ i OpenGL per implementar aquest game engine , el qual s'ha programat de la forma més eficient possible i buscant un bon rendiment en l'ús de l'aplicació. The objective of this project is to develop an application that allows users with no technical knowledge to create simple video games. On this way, I created a game engine with adapted functionalities for this kind of public, in order to offer a comfortable and instructive experience and, at the same time, providing tools that they are flexible enough to combine themselves in creative ways to generate more complex creations. C++ and OpenGL have been used for programming this game engine, looking for a good performance when the application is used.", "keywords": "Video games Mobile apps Videojocs Aplicacions mòbils"},
{"title": "CAPSiDE --- NTT - Client Portal", "url": "https://upcommons.upc.edu/handle/2117/329431", "author": "Gallofré Bahón, Andreu", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-07-03", "rights": "Restricted access - confidentiality agreement", "abstract": null, "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.8273088932037354, "description": "", "keywords": "Python (Computer program language) Information visualization Python (Llenguatge de programació) Visualització de la informació"},
{"title": "Caracterització i detecció de textos generats artificialment", "url": "https://upcommons.upc.edu/handle/2117/329241", "author": "Casas Muñoz, Antoni", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-06-26", "rights": "Open Access", "abstract": "Millores recents en el camp dels models de llenguatge natural han portat a la creació de nous models generadors de llenguatge, aquests nous models són de gran qualitat, i en certes ocasions, diferenciar-los d'allò que un ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.8173134326934814, "description": "Millores recents en el camp dels models de llenguatge natural han portat a la creació de nous models generadors de llenguatge, aquests nous models són de gran qualitat, i en certes ocasions, diferenciar-los d'allò que un humà escriuria o faria és extremadament complex. A la vegada, usos il·legitims d'aquesta nova tecnologia estan creixent, per tant és d'interès la comprensió d'aquests models per a la seva millora, i per a la detecció d'usos il·legitims d'aquests. Aquest treball examina diferents lleis i distribucions sobre el llenguatge natural, i examina quines diferències existeixen entre el text generat pel model màquina GPT2, el state of the art actual, i text escrit per humans. Específicament analitza la distribució de categories gramaticals, entropia condicional sobre el text, entropia condicional sobre les seves categories gramaticals, i entropia condicional sobre els caràcters del text, la distribució de zipf, la distribució de les mides de grups de correferències, la distribució de mides de paraula i la distribució de la polisèmia de cada paraula. També s'ha desenvolupat una API REST documentada per Swagger 2.0 per a facilitar l'extracció d'aquesta informació i fer futurs anàlisis d'aquest estil més fàcils, i permetre la integració d'aquesta informació a processos d'extracció d'informació per l'avaluació de models de llenguatge natural creats amb aprenentatge màquina. Recent innovations in the field of natural language modelling have brought the creation of new generative language models. These new models are of great quality, and in certain occasions, differentiating between these and what a human would write is extremely complex. At the same time, nefarious uses of this technology have been growing, so the comprehension of these is of great importance for their improvement and detection of nefarious uses by these. This work examines different laws and distributions over the natural language, and examines which differences are present between human text and GPT2, the current state of the art. Specifically, it analyzes the distribution of parts of speech, conditional entropy over text, parts of speech and characters, distribution of the size of correference clusters, the zipf distribution, the distribution of word size, and the distribution of each word's polysemy. At the same time, a REST API documented by Swagger 2.0 has been developed to facilitate extraction of information for future analysis of this type, and to allow the integration of this information to processes which extract information to evaluate natural language models generated by machine learning.", "keywords": "Computational linguistics Natural language processing (Computer science) Lingüística computacional Tractament del llenguatge natural (Informàtica)"},
{"title": "Desenvolupament d'un projecte end to end en business intelligence", "url": "https://upcommons.upc.edu/handle/2117/329429", "author": "Fonollà Llobet, Oriol", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-06-14", "rights": "Restricted access - confidentiality agreement", "abstract": null, "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.8523111343383789, "description": "", "keywords": "Capital market Anàlisi de dades Mercats financers"},
{"title": "Estudio, análisis e implementación del entorno productivo para el uso de modelos de deep learning", "url": "https://upcommons.upc.edu/handle/2117/329426", "author": "García Domenech, David", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-06-26", "rights": "Open Access", "abstract": "Cuando se trabaja con Deep Learning y redes neuronales principalmente existen 2 etapas: entrenamiento e inferencia. La mayoría de los investigadores trabajan sobre la primera para lograr modelos que resuelvan mejor problemas ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.8622784614562988, "description": "Cuando se trabaja con Deep Learning y redes neuronales principalmente existen 2 etapas: entrenamiento e inferencia. La mayoría de los investigadores trabajan sobre la primera para lograr modelos que resuelvan mejor problemas cada vez más variados y complejos pero una vez resuelto se les debe dar aplicabilidad. Las organizaciones que trabajan con redes neuronales y las utilizan dentro de sus procesos requieren utilizarlas para inferencia, donde estas redes pasan el mayor tiempo de su vida útil hasta ser renovadas. Es en este caso, cuando distintos aspectos que no se contemplan en el entrenamiento ganan una relevancia estratégica para las organizaciones como: la gestión de los recursos para poder dimensionar su infraestructura, los tiempos de respuesta impuestos por los requerimientos de su modelo de negocio, etc. Un aspecto crucial es la capacidad de estas organizaciones respecto a la infraestructura ya que las empresas que la posean necesitan optimizar el uso para obtener el mejor rendimiento adaptándose a las características de sus máquinas. Por contra, en el mundo Cloud se dispone de recursos infinitos donde la gestión de los mismos tiene una repercusión directa en los costes de la utilización de estos servicios. La tendencia es cada vez más utilizar infraestructura en Cloud por todas las ventajas que ello supone. En este proyecto se estudian herramientas que facilitan el uso de redes neuronales en entornos productivos, ayudando con el despliegue de posibles arquitecturas tanto en infraestructura local como alojada en Cloud público basadas en la virtualización en contenedores. Esta virtualización se lleva a cabo mediante la imagen de Docker de TensorFlow Serving, con el cual posteriormente se propone una arquitectura de entorno gobernada por Kubernetes para un entorno local y su alternativa homóloga en Cloud dentro de los servicios ofrecidos en Amazon Web Services. Working with Deep Learning and neural networks there are mainly 2 stages: training and inference. Most researchers work on the first one to achieve models that solve better increasingly varied and complex problems but once solved they must be given applicability. Organizations that work with neural networks and use them within their processes need to use them for inference, where these networks spend most of their life until they are renewed. It is in this case, when different aspects that are not contemplated in the training those that gain a strategic relevance for the organizations as: the management of the resources to be able to dimension its infrastructure, the response time imposed by the requirements of its model of business, etc. A crucial aspect is the capacity of these organizations about the infrastructure since the companies that have it need to optimize the use to obtain the best performance adapting to the characteristics of their machines. On the other hand, in the Cloud world there are infinite resources available where their management has a direct impact on the costs of using these services. The trend is to use more and more infrastructure in the Cloud for all the advantages that this entails. This project studies tools that facilitate the use of neural networks in productive environments, helping with the deployment of possible architectures both in local infrastructure and hosted in public Cloud based on virtualization in containers. This virtualization is carried out through the image of TensorFlow Serving's Docker, with which an environment architecture governed by Kubernetes is later proposed for a local environment and its alternative counterpart in the Cloud within the services offered by Amazon Web Services.", "keywords": "Neural networks (Computer science) Machine learning Cloud computing Xarxes neuronals (Informàtica) Aprenentatge automàtic Computació en núvol"},
{"title": "A flexible proxy for traffic optimization", "url": "https://upcommons.upc.edu/handle/2117/329258", "author": "Van Heijningen, Stefan Alexande", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-06-22", "rights": "Restricted access - confidentiality agreement", "abstract": null, "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.6092355251312256, "description": "", "keywords": "Routers (Computer networks) Encaminadors (Xarxes d'ordinadors)"},
{"title": "Carbon footprint of companies", "url": "https://upcommons.upc.edu/handle/2117/329411", "author": "Mateu Jordi, Pau", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-06-22", "rights": "Open Access", "abstract": "Avui en dia, tant en el món empresarial com el social, pocs conceptes tenen tanta rellevància com el de la sostenibilitat. De manera resumida, podem definir la sostenibilitat com el desenvolupament que satisfà les necessitats ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.42658519744873047, "description": "Avui en dia, tant en el món empresarial com el social, pocs conceptes tenen tanta rellevància com el de la sostenibilitat. De manera resumida, podem definir la sostenibilitat com el desenvolupament que satisfà les necessitats del present sense comprometre la capacitat de les generacions futures. Aquest concepte es fonamenta en 3 pilars: la sostenibilitat ambiental, la sostenibilitat econòmica i la sostenibilitat social. Aquest treball presenta l'anàlisi d'una problemàtica que afecta directament a la sostenibilitat ambiental de les empreses, i recull els passos seguits per a proposar, dissenyar i implementar una solució software que la resol. Juntament amb 3 companys d'equip d'arreu d'Europa, gràcies a la iniciativa EPIC d'Erasmus +, s'ha treballat amb l'empresa alemana Atene KOM per a fer més fàcil a el càlcul de les emissions del cicle de vida de productes i serveis. L'objectiu del projecte és clar: desenvolupar un sistema que faciliti i redueixi el cost, tant de temps com de diners, d'aquest càlcul complex d'emissions. Aquest objectiu es materialitza partir d'una recerca prèvia de l'estat de l'art i la problemàtica, un disseny i especificació completa del software que soluciona el problema, i la implementació i desplegament del mateix. Nowadays, in both, the business and social world, few concepts are as relevant as sustainability. In brief, one can define sustainability as that development that meets the needs of the present without compromising the capacity of future generations. This concept i based on three key pillars: environmental sustainability, economic sustainability and social sustainability. This project presents the analysis of a problem that directly affects the environmental sustainability of companies, and includes the steps followed to propose, design and implement a software solution that solves it. Together with 3 teammates from all over Europe, thanks to the Erasmus + EPIC initiative, we have worked with the German company Atene KOM to make calculating the life cycle emissions of products and services easier. The objective of the project is clear: to develop a system that facilitates and reduces the cost, both of time and money, of this complex calculation of emissions. This objective is materialized with an investigation of the state of the art and the problem, a design and complete specification of the software that solves the problem, and its implementation and deployment.", "keywords": "Sustainable development Climatic changes Software engineering Desenvolupament sostenible Canvis climàtics Enginyeria de programari"},
{"title": "Aplicació per al seguiment de les migranyes", "url": "https://upcommons.upc.edu/handle/2117/329372", "author": "Olivella Morató, Àlex", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-01-28", "rights": "Open Access", "abstract": "El treball consisteix a desenvolupar una aplicació mòbil pel control i seguiment de les migranyes. Aquesta aplicació està destinada a dos tipus d'usuaris: els pacients i els metges. La funcionalitat principal que té aquesta ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.5026795864105225, "description": "El treball consisteix a desenvolupar una aplicació mòbil pel control i seguiment de les migranyes. Aquesta aplicació està destinada a dos tipus d'usuaris: els pacients i els metges. La funcionalitat principal que té aquesta aplicació és poder registrar una migranya on es podrà especificar l'hora d'inici, l'hora de final, la intensitat del dolor, la zona del cap on es produeix el dolor, els símptomes que pateix la persona durant l'atac, les causes que la persona creu que han pogut provocar la migranya, els impediments que l'atac ha causat, l'exercici que prèviament hagi realitzat, el grau de menstruació que tingui en aquell moment (en cas de ser dona o altres en el gènere) i els medicaments que hagi pres durant l'atac. Altres funcionalitats que té l'aplicació són les de tenir un calendari per poder veure els dies que s'han produït aquests atacs, on també podrem veure les cites que té amb un doctor associat. Seguint amb les funcionalitats podrem consultar el temps actual per veure el risc de produir-se una migranya. Tal com hem mencionat abans, al tenir un metge associat vol dir que tenim una funcionalitat per complir aquesta associació. Altres funcionalitats menors que té l'aplicació són consultar i canviar el perfil de l'usuari i poder fer log in, registrar-se, etc. Si ara mencionem les funcionalitats del metge, tindríem que aquest podrà consultar la informació dels pacients associats i les migranyes que aquests tenen juntament amb poder afegir les cites abans mencionades i poder editar-les, esborrar-les, etc. The work consists in develop a mobile application for the monitoring of migraines. This application is destined to 2 types of users: patients and doctors. The main functionality that the application have is register a migraine where in this, you can specify the start time, the end time, the intensity pain, the head zone where the pain is produced, the symptoms that the person suffers during the attack, the causes that the person believes have been able to cause migraine, the impediments that the attack caused, the exercise that the person had done, the scale of period that the person had at that moment (if the gender is female or others) and the medicines taken during the attack. Other functionalities that the application have is having a calendar to see the days the those attacks had been produced, where we can see the appointments that the patient have with an associated doctor. Continuing with the functionalities we can consult the actual weather to see the risk of a migraine happening As we said before, if we have an associated doctor, we have a functionality to fulfill this association Other minor functionalities that the application have is check and change the user profile and be able to log in, sign up, etc... If we now focus at the doctor functionalities, we see that he can check the associated patients info and the migraine that those have together with be able to add the before mentioned appointments and be able to edit them, delete, etc...", "keywords": "Mobile apps Migraine Aplicacions mòbils Migranya"},
{"title": "Comunicació i tractament de dades en projectes oritentats a l'electrònica de potència", "url": "https://upcommons.upc.edu/handle/2117/329373", "author": "Puig Sanchez, Sergi", "publisher": "Universitat Politècnica de Catalunya", "date": "2020-06", "rights": "Open Access", "abstract": "En el mundo de la informática y la comunicación hay una necessidad muy importante de comunicar diferentes dispositivos electrónicos de forma remota y dependiendo del sector en el que estemos trabajando puede ser que el ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.4985208511352539, "description": "En el mundo de la informática y la comunicación hay una necessidad muy importante de comunicar diferentes dispositivos electrónicos de forma remota y dependiendo del sector en el que estemos trabajando puede ser que el idioma en el que hable cada dispositivo sea totalmente diferente. Por eso necesitamos un programa que nos permita usar todos los protocolos que necesitamos, en el sistema operativo que usamos y con el rol que sea pertinente en el proyecto. El objetivo de este proyecto es diseñar e implementar un programa capaz de procesar la información de los paquetes de datos recibidos independientemente de su protocolo (siempre que esté implementado en el programa) que permita al CITCEA-UPC optimizar el tiempo de desarrollo de los proyectos utilizando nuestro programa, abstracto y modular. In the communication and computer science world, there is a really important need to communicate different kinds of electronic devices remotely and depending on the sector in which we are working it's possible that they speak different languages. So we need a programm that allows us to use all the protocols we need, on the operating system we work on and the rol that is needed in the project. The objective of this project is to design and implement a program capable of processing all the information we receive from the data packages regardless of their protocol (as long as it is implemented in the program) that will allow CITCEA-UPC to optimize the development time of projects using our modular and abstract program.", "keywords": "Embedded computer systems Raspberry Pi (Computer) Sistemes incrustats (Informàtica) Raspberry Pi (Ordinador)"}
]